---
kind: type
id: T:Autodesk.Revit.DB.IntersectionResult
source: html/0b6f0c2e-e3a2-3e27-fa52-0f4f9f2ca6f0.htm
---
# Autodesk.Revit.DB.IntersectionResult

This class captures results of intersecting geometric entities. "Intersecting" is meant
in generalized sense, so the same class will be used for projection, containment, etc.
Refer to the documentation of the method providing the result for the precise meaning of properties.

## Syntax (C#)
```csharp
public class IntersectionResult : APIObject
```